In [2]:
import pandas as pd
df=pd.read_csv("tips.csv")
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [3]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [4]:
df.shape

(244, 7)

In [5]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='str')

In [6]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    str
 3   smoker      244 non-null    str
 4   day         244 non-null    str
 5   time        244 non-null    str
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), str(4)
memory usage: 13.5 KB

In [7]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [8]:
df.describe(include="all")

        total_bill         tip   sex smoker  day    time        size
count   244.000000  244.000000   244    244  244     244  244.000000
unique         NaN         NaN     2      2    4       2         NaN
top            NaN         NaN  Male     No  Sat  Dinner         NaN
freq           NaN         NaN   157    151   87     176         NaN
mean     19.785943    2.998279   NaN    NaN  NaN     NaN    2.569672
std       8.902412    1.383638   NaN    NaN  NaN     NaN    0.951100
min       3.070000    1.000000   NaN    NaN  NaN     NaN    1.000000
25%      13.347500    2.000000   NaN    NaN  NaN     NaN    2.000000
50%      17.795000    2.900000   NaN    NaN  NaN     NaN    2.000000
75%      24.127500    3.562500   NaN    NaN  NaN     NaN    3.000000
max      50.810000   10.000000   NaN    NaN  NaN     NaN    6.000000

In [9]:
df.describe(include=object)

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_10208\3998025828.py:1: Pandas4Warning: For backward compatibility, 'str' dtypes are included by select_dtypes when 'object' dtype is specified. This behavior is deprecated and will be removed in a future version. Explicitly pass 'str' to `include` to select them, or to `exclude` to remove them and silence this warning.
See https://pandas.pydata.org/docs/user_guide/migration-3-strings.html#string-migration-select-dtypes for details on how to write code that works with pandas 2 and 3.
  df.describe(include=object)

         sex smoker  day    time
count    244    244  244     244
unique     2      2    4       2
top     Male     No  Sat  Dinner
freq     157    151   87     176

In [10]:
df.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

The output shows that the count of null values in each column is 0. This means there are no missing values in the dataset and the data is complete.

This helps in understanding data quality. Since there are no missing values, data cleaning using fillna() or dropna() is not required.

In [11]:
df["sex"].value_counts()

sex
Male      157
Female     87
Name: count, dtype: int64

In [12]:
df["total_bill"].mean()

np.float64(19.78594262295082)

In [13]:
df["total_bill"].max()
# df["total_bill"].min()

np.float64(50.81)

In [14]:
# df.head(10)
df.sort_values(by="tip")

     total_bill    tip     sex smoker   day    time  size
92         5.75   1.00  Female    Yes   Fri  Dinner     2
111        7.25   1.00  Female     No   Sat  Dinner     1
67         3.07   1.00  Female    Yes   Sat  Dinner     1
236       12.60   1.00    Male    Yes   Sat  Dinner     2
0         16.99   1.01  Female     No   Sun  Dinner     2
..          ...    ...     ...    ...   ...     ...   ...
141       34.30   6.70    Male     No  Thur   Lunch     6
59        48.27   6.73    Male     No   Sat  Dinner     4
23        39.42   7.58    Male     No   Sat  Dinner     4
212       48.33   9.00    Male     No   Sat  Dinner     4
170       50.81  10.00    Male    Yes   Sat  Dinner     3

[244 rows x 7 columns]

In [15]:
df["sex"].value_counts()

sex
Male      157
Female     87
Name: count, dtype: int64

The dataset contains more male records compared to female records, indicating an imbalance in gender distribution.
This information is useful for demographic analysis and identifying gender-based trends.

In [16]:
df["smoker"].unique()

<StringArray>
['No', 'Yes']
Length: 2, dtype: str

There are two categories: Yes and No.Helps identify smoker and non-smoker groups.

In [17]:
df["day"].nunique()
df["day"].unique()

<StringArray>
['Sun', 'Sat', 'Thur', 'Fri']
Length: 4, dtype: str

There are only 4 unique days in the dataset, which means restaurant visits are limited to Thursday, Friday, Saturday, and Sunday.This helps analyze customer behavior and identify peak business days, which can be useful for improving service and resource planning.

In [18]:
df.dropna()

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [19]:
df.fillna(0)

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [20]:
df.fillna(df.mean(numeric_only=True))

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [21]:
df.duplicated().sum()

np.int64(1)

1 duplicate Row

In [22]:
df.drop_duplicates(inplace=True)

Removing Duplicate

In [23]:
df.duplicated().sum()

np.int64(0)

In [24]:
df.corr(numeric_only=True)

            total_bill       tip      size
total_bill    1.000000  0.674998  0.597589
tip           0.674998  1.000000  0.488400
size          0.597589  0.488400  1.000000

The correlation matrix shows that total_bill and tip have a strong positive correlation (0.67), which means that as the total bill increases, the tip amount also increases. Similarly, total_bill and size also have positive correlation (0.59), indicating that larger groups tend to have higher total bills.

In [25]:
df.sample(5).sort_index()

     total_bill   tip     sex smoker   day    time  size
46        22.23  5.00    Male     No   Sun  Dinner     2
65        20.08  3.15    Male     No   Sat  Dinner     3
97        12.03  1.50    Male    Yes   Fri  Dinner     2
133       12.26  2.00  Female     No  Thur   Lunch     2
236       12.60  1.00    Male    Yes   Sat  Dinner     2

In [26]:
df.iloc[0:3,1:4]

    tip     sex smoker
0  1.01  Female     No
1  1.66    Male     No
2  3.50    Male     No

Helps select specific rows and columns.

In [27]:
df.iat[2,1]

np.float64(3.5)

Used when only one value is needed.

In [28]:
df.mode()

   total_bill  tip   sex smoker  day    time  size
0       13.42  2.0  Male     No  Sat  Dinner     2

The mode function shows the most frequent values in each column. From the output, the most common customer is Male, non-smoker, visiting on Saturday during Dinner, with group size of 2 and tip amount of 2.0.This helps identify the most common customer behavior, which can be useful for business planning and improving customer service.

In [29]:
df.head(10)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

In [30]:
df["discount_bill"] = df["total_bill"] * 0.90

In [31]:
df.head()

   total_bill   tip     sex smoker  day    time  size  discount_bill
0       16.99  1.01  Female     No  Sun  Dinner     2         15.291
1       10.34  1.66    Male     No  Sun  Dinner     3          9.306
2       21.01  3.50    Male     No  Sun  Dinner     3         18.909
3       23.68  3.31    Male     No  Sun  Dinner     2         21.312
4       24.59  3.61  Female     No  Sun  Dinner     4         22.131

In [32]:
df.dtypes

total_bill       float64
tip              float64
sex                  str
smoker               str
day                  str
time                 str
size               int64
discount_bill    float64
dtype: object

In [33]:
df.std(numeric_only=True)

total_bill       8.910071
tip              1.385002
size             0.952356
discount_bill    8.019064
dtype: float64

Standard deviation measures the variability or dispersion of data from the average value.It helps in normalization and standardization of data, which is important for machine learning and statistical analysis.

In [34]:
df.ndim

2

In [35]:
df.info()

<class 'pandas.DataFrame'>
Index: 243 entries, 0 to 243
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   total_bill     243 non-null    float64
 1   tip            243 non-null    float64
 2   sex            243 non-null    str
 3   smoker         243 non-null    str
 4   day            243 non-null    str
 5   time           243 non-null    str
 6   size           243 non-null    int64
 7   discount_bill  243 non-null    float64
dtypes: float64(3), int64(1), str(4)
memory usage: 17.1 KB

In [36]:
df.select_dtypes(include=['str'])

        sex smoker   day    time
0    Female     No   Sun  Dinner
1      Male     No   Sun  Dinner
2      Male     No   Sun  Dinner
3      Male     No   Sun  Dinner
4    Female     No   Sun  Dinner
..      ...    ...   ...     ...
239    Male     No   Sat  Dinner
240  Female    Yes   Sat  Dinner
241    Male    Yes   Sat  Dinner
242    Male     No   Sat  Dinner
243  Female     No  Thur  Dinner

[243 rows x 4 columns]

In [37]:
df.head()

   total_bill   tip     sex smoker  day    time  size  discount_bill
0       16.99  1.01  Female     No  Sun  Dinner     2         15.291
1       10.34  1.66    Male     No  Sun  Dinner     3          9.306
2       21.01  3.50    Male     No  Sun  Dinner     3         18.909
3       23.68  3.31    Male     No  Sun  Dinner     2         21.312
4       24.59  3.61  Female     No  Sun  Dinner     4         22.131

In [38]:
df.select_dtypes(include=['int'])

     size
0       2
1       3
2       3
3       2
4       4
..    ...
239     3
240     2
241     2
242     2
243     2

[243 rows x 1 columns]

In [39]:
df.size

1944

In [40]:
df.shape

(243, 8)

After Removing one duplicate row and adding one column

In [41]:
df.notnull().sum()

total_bill       243
tip              243
sex              243
smoker           243
day              243
time             243
size             243
discount_bill    243
dtype: int64

In [42]:
df["tip_category"]=df["tip"].apply(lambda tip:"Low" if tip<2 else ("Medum" if tip<5 else "High"))

In [43]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,discount_bill,tip_category
0,16.99,1.01,Female,No,Sun,Dinner,2,15.291,Low
1,10.34,1.66,Male,No,Sun,Dinner,3,9.306,Low
2,21.01,3.50,Male,No,Sun,Dinner,3,18.909,Medum
3,23.68,3.31,Male,No,Sun,Dinner,2,21.312,Medum
4,24.59,3.61,Female,No,Sun,Dinner,4,22.131,Medum

In [44]:
df.sort_values(by="tip")

,total_bill,tip,sex,smoker,day,time,size,discount_bill,tip_category
92,5.75,1.00,Female,Yes,Fri,Dinner,2,5.175,Low
111,7.25,1.00,Female,No,Sat,Dinner,1,6.525,Low
67,3.07,1.00,Female,Yes,Sat,Dinner,1,2.763,Low
236,12.60,1.00,Male,Yes,Sat,Dinner,2,11.340,Low
0,16.99,1.01,Female,No,Sun,Dinner,2,15.291,Low
...,...,...,...,...,...,...,...,...,...
141,34.30,6.70,Male,No,Thur,Lunch,6,30.870,High
59,48.27,6.73,Male,No,Sat,Dinner,4,43.443,High
23,39.42,7.58,Male,No,Sat,Dinner,4,35.478,High
212,48.33,9.00,Male,No,Sat,Dinner,4,43.497,High
170,50.81,10.00,Male,Yes,Sat,Dinner,3,45.729,High

In [45]:
df.to_csv("output.csv",index=False)

In [46]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,discount_bill,tip_category
0,16.99,1.01,Female,No,Sun,Dinner,2,15.291,Low
1,10.34,1.66,Male,No,Sun,Dinner,3,9.306,Low
2,21.01,3.50,Male,No,Sun,Dinner,3,18.909,Medum
3,23.68,3.31,Male,No,Sun,Dinner,2,21.312,Medum
4,24.59,3.61,Female,No,Sun,Dinner,4,22.131,Medum

In [49]:
df[(df["tip_category"]=="High") & (df["smoker"]=="Yes")].value_counts()

total_bill  tip    sex     smoker  day   time    size  discount_bill  tip_category
25.28       5.00   Female  Yes     Sat   Dinner  2     22.752         High            1
32.68       5.00   Male    Yes     Thur  Lunch   2     29.412         High            1
50.81       10.00  Male    Yes     Sat   Dinner  3     45.729         High            1
7.25        5.15   Male    Yes     Sun   Dinner  2     6.525          High            1
23.33       5.65   Male    Yes     Sun   Dinner  2     20.997         High            1
23.17       6.50   Male    Yes     Sun   Dinner  4     20.853         High            1
43.11       5.00   Female  Yes     Thur  Lunch   4     38.799         High            1
25.89       5.16   Male    Yes     Sat   Dinner  4     23.301         High            1
28.17       6.50   Female  Yes     Sat   Dinner  3     25.353         High            1
Name: count, dtype: int64